cfe llm/Catalogs/AI_ПрофилиДоступаКДанным.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_ПрофилиДоступаКДанным</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазрешитьВыполнениеЗапросов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумШагов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумЗапросовКДанным</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумСтрокРезультата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяДлинаЗапроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрешенныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребоватьПериод</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОграниченныеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_ПрофилиДоступаКДанным/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьОбъектыМетаданных(Команда)

	ПараметрыФормы = Новый Структура("Режим", "Объекты");
	ОповещениеОЗакрытии = Новый ОписаниеОповещения(
		"ПодборОбъектовЗавершение",
		ЭтотОбъект);
	ОткрытьФорму(
		"Справочник.AI_ПрофилиДоступаКДанным.Форма.ПодборМетаданных",
		ПараметрыФормы,
		ЭтаФорма,
		,
		,
		,
		ОповещениеОЗакрытии);

КонецПроцедуры

&НаКлиенте
Процедура ПодобратьОграниченныеПоля(Команда)

	Если Объект.РазрешенныеОбъекты.Количество() = 0 Тогда
		Сообщить("Сначала добавьте хотя бы один разрешенный объект.");
		Возврат;
	КонецЕсли;

	РазрешенныеОбъекты = Новый Массив;
	Для Каждого РазрешенныйОбъект Из Объект.РазрешенныеОбъекты Цикл
		Если ЗначениеЗаполнено(РазрешенныйОбъект.ПолноеИмя) Тогда
			РазрешенныеОбъекты.Добавить(РазрешенныйОбъект.ПолноеИмя);
		КонецЕсли;
	КонецЦикла;

	ПараметрыФормы = Новый Структура("Режим,РазрешенныеОбъекты", "Поля", РазрешенныеОбъекты);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения(
		"ПодборПолейЗавершение",
		ЭтотОбъект);
	ОткрытьФорму(
		"Справочник.AI_ПрофилиДоступаКДанным.Форма.ПодборМетаданных",
		ПараметрыФормы,
		ЭтаФорма,
		,
		,
		,
		ОповещениеОЗакрытии);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ПодборОбъектовЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ВыбранныйОбъект Из РезультатЗакрытия Цикл
		Если ОбъектУжеДобавлен(ВыбранныйОбъект.ПолноеИмяОбъекта) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Объект.РазрешенныеОбъекты.Добавить();
		НоваяСтрока.ПолноеИмя = ВыбранныйОбъект.ПолноеИмяОбъекта;
		НоваяСтрока.ТребоватьПериод = ВыбранныйОбъект.ТребоватьПериод;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПодборПолейЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ВыбранноеПоле Из РезультатЗакрытия Цикл
		Если ПолеУжеДобавлено(ВыбранноеПоле.ПолноеИмяОбъекта, ВыбранноеПоле.ИмяПоля) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Объект.ОграниченныеПоля.Добавить();
		НоваяСтрока.ПолноеИмяОбъекта = ВыбранноеПоле.ПолноеИмяОбъекта;
		НоваяСтрока.ИмяПоля = ВыбранноеПоле.ИмяПоля;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ОбъектУжеДобавлен(ПолноеИмяОбъекта)

	Для Каждого РазрешенныйОбъект Из Объект.РазрешенныеОбъекты Цикл
		Если НРег(СокрЛП(РазрешенныйОбъект.ПолноеИмя)) = НРег(СокрЛП(ПолноеИмяОбъекта)) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

&НаКлиенте
Функция ПолеУжеДобавлено(ПолноеИмяОбъекта, ИмяПоля)

	Для Каждого ОграниченноеПоле Из Объект.ОграниченныеПоля Цикл
		Если НРег(СокрЛП(ОграниченноеПоле.ПолноеИмяОбъекта)) = НРег(СокрЛП(ПолноеИмяОбъекта))
				И НРег(СокрЛП(ОграниченноеПоле.ИмяПоля)) = НРег(СокрЛП(ИмяПоля)) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

#КонецОбласти
